InformationRegisters/ГрейдыПозиций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГрейдыПозиций</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Грейд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Грейды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Позиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГрейдыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ГрейдыСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Грейд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Грейды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГрейдПоОкончании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Грейды</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Грейды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Грейды</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВАрхиве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ГрейдыСборСтатистики/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область СтатистикиКонфигурации

// См. ЦентрМониторингаПереопределяемый.ПриСбореПоказателейСтатистикиКонфигурации.
Процедура ПриСбореПоказателейСтатистикиКонфигурации() Экспорт
	
	ИмяКонфигурации = КонфигурацииЗарплатаКадры.КраткоеНазваниеПрограммыСлужебный();
	// АПК:1297-выкл Имя подсистемы для статистики, не локализуется
	ИмяПодсистемы = "Грейды";
	// АПК:1297-вкл
	
	ВидСтатистики = СборСтатистики.ВидыСтатистики().Накопительная;
	
	Статистика = Новый Соответствие;
	Статистика.Вставить("Грейды", СтатистикаГрейдов());
	Статистика.Вставить("Грейды позиций", СтатистикаГрейдовПозиций());
	Статистика.Вставить("Грейды сотрудников", СтатистикаГрейдовСотрудников());
	Статистика.Вставить("Оценка позиций штатного расписания по критериям", СтатистикаПозицийШтатногоРасписания());
	СборСтатистики.ЗаписатьСтатистикуПоОбъектам(ИмяКонфигурации, ИмяПодсистемы, Статистика, ВидСтатистики);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СтатистикиКонфигурации

// АПК:1297-выкл Статистика, не локализуется

Функция СтатистикаГрейдов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Грейды.Ссылка) КАК Грейдов
		|ИЗ
		|	Справочник.Грейды КАК Грейды
		|ГДЕ
		|	Грейды.ВАрхиве = ЛОЖЬ
		|	И Грейды.ПометкаУдаления = ЛОЖЬ";
	
	ПоказателиСтатистики = Новый Соответствие;
	ПоказателиСтатистики.Вставить("Грейдов", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Грейдов")[0]);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаГрейдовПозиций()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрейдыПозиций.Позиция) КАК Позиций
		|ИЗ
		|	РегистрСведений.ГрейдыПозиций КАК ГрейдыПозиций
		|ГДЕ
		|	ГрейдыПозиций.Грейд <> ЗНАЧЕНИЕ(Справочник.Грейды.ПустаяСсылка)";
	
	ПоказателиСтатистики = Новый Соответствие;
	ПоказателиСтатистики.Вставить("Позиций с грейдами", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Позиций")[0]);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаГрейдовСотрудников()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ГрейдыСотрудников.Сотрудник) КАК Сотрудников
		|ИЗ
		|	РегистрСведений.ГрейдыСотрудников КАК ГрейдыСотрудников
		|ГДЕ
		|	ГрейдыСотрудников.Грейд <> ЗНАЧЕНИЕ(Справочник.Грейды.ПустаяСсылка)";
	
	ПоказателиСтатистики = Новый Соответствие;
	ПоказателиСтатистики.Вставить("Сотрудников с грейдами", Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сотрудников")[0]);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

Функция СтатистикаПозицийШтатногоРасписания()
	
	Таблица = Метаданные.РегистрыСведений.ОценкаПозицийШтатногоРасписанияПоКритериям;
	ДанныеСтатистики = СборСтатистики.ДанныеСбораСтатистики();
	
	ДанныеСтатистики.ДанныеОбъекта.Объект = Таблица.Измерения.Позиция;
	ДанныеСтатистики.ДанныеОбъекта.ПредставлениеОбъектов = "Позиций";
	
	ДанныеГруппировок = Новый Массив;
	
	ДанныеГруппировки = СборСтатистики.ДанныеГруппировки();
	ДанныеГруппировки.Группировка = Таблица.Измерения.КритерийОценки;
	ДанныеГруппировки.ПредставлениеГруппировки = "Критериев оценки";
	ДанныеГруппировок.Добавить(ДанныеГруппировки);
	
	ДанныеСтатистики.ДанныеГруппировок = ДанныеГруппировок;
	
	ПоказателиСтатистики = СборСтатистики.СтандартныеПоказателиПоТаблице(Таблица, ДанныеСтатистики);
	
	Возврат ПоказателиСтатистики;
	
КонецФункции

// АПК:1297-вкл

#КонецОбласти

#КонецОбласти
